return {
	'folke/snacks.nvim',
	priority = 1000,
	lazy = false,
	opts = {
		bigfile = { enabled = true },
		dashboard = {
			enabled = true,
			preset = {
				header = [[
██╗     ███████╗██╗   ██╗██╗   ██╗██╗███╗   ███╗
██║     ██╔════╝██║   ██║██║   ██║██║████╗ ████║
██║     █████╗  ██║   ██║██║   ██║██║██╔████╔██║
██║     ██╔══╝  ╚██╗ ██╔╝╚██╗ ██╔╝██║██║╚██╔╝██║
███████╗███████╗ ╚████╔╝  ╚████╔╝ ██║██║ ╚═╝ ██║
╚══════╝╚══════╝  ╚═══╝    ╚═══╝  ╚═╝╚═╝     ╚═╝]],
			},
			sections = {
				{ section = 'header' },
				{
					icon = ' ',
					title = 'Keymaps',
					section = 'keys',
					indent = 2,
					padding = 1,
				},
				{
					icon = ' ',
					title = 'Recent Files',
					section = 'recent_files',
					indent = 2,
					padding = 1,
				},
				{
					icon = ' ',
					title = 'Projects',
					section = 'projects',
					indent = 2,
					padding = 1,
				},
				{ section = 'startup' },
			},
		},
		quickfile = { enabled = true },
		win = { relative = 'cursor', backdrop = true },
	},
}
